// import json from "./370000.geojson";
const fs = require("fs");

const viewInfo = {
  origin: {
    RTU: { eye: [-95, 200, -205], center: [-95, 145, -55] },
    一级贯通进线柜: { eye: [20, 220, -95], center: [245, 125, -95] },
    一级贯通出线柜: { eye: [20, 220, -85], center: [245, 125, -85] },
    一级贯通变压器出线柜: { eye: [20, 220, -60], center: [245, 125, -60] },
    一级贯通电抗器出线柜: { eye: [20, 220, -130], center: [245, 125, -130] },
    综合贯通进线柜: { eye: [-20, 195, -80], center: [-125, 160, -80] },
    综合贯通出线柜: { eye: [-20, 195, -60], center: [-125, 160, -60] },
    综合贯通变压器出线柜: { eye: [-20, 195, -30], center: [-125, 160, -30] },
    综合贯通电气化所出线柜: {
      eye: [-20, 195, -100],
      center: [-125, 160, -100],
    },
    一级贯通低压进出线柜: { eye: [180, 200, -205], center: [180, 145, -55] },
    双切柜: { eye: [110, 200, -205], center: [110, 145, -55] },
    综合贯通低压进出线柜: { eye: [-130, 220, -205], center: [-130, 145, -55] },
    一级贯通变压器: { eye: [505, 260, 160], center: [160, 45, 50] },
    综合贯通变压器: { eye: [-490, 250, 185], center: [-40, -80, -90] },
    一级贯通低压进出线柜回路1: {
      eye: [180, 165, -120],
      center: [180, 140, -50],
    },
    一级贯通低压进出线柜回路2: {
      eye: [180, 165, -120],
      center: [180, 140, -50],
    },
    一级贯通低压进出线柜回路3: {
      eye: [180, 165, -120],
      center: [180, 140, -50],
    },
    一级贯通低压进出线柜回路4: {
      eye: [180, 165, -120],
      center: [180, 140, -50],
    },
    一级贯通低压进出线柜回路5: {
      eye: [180, 165, -120],
      center: [180, 140, -50],
    },
    一级贯通低压进出线柜回路6: {
      eye: [180, 165, -120],
      center: [180, 140, -50],
    },
    一级贯通低压进出线柜回路7: {
      eye: [180, 165, -120],
      center: [180, 140, -50],
    },
    双切柜回路1: { eye: [110, 190, -170], center: [110, 145, -55] },
    双切柜回路2: { eye: [110, 190, -170], center: [110, 145, -55] },
    双切柜回路3: { eye: [110, 190, -170], center: [110, 145, -55] },
    综合贯通低压进出线柜回路1: {
      eye: [-130, 165, -120],
      center: [-130, 140, -50],
    },
    综合贯通低压进出线柜回路2: {
      eye: [-130, 165, -120],
      center: [-130, 140, -50],
    },
    综合贯通低压进出线柜回路3: {
      eye: [-130, 165, -120],
      center: [-130, 140, -50],
    },
    综合贯通低压进出线柜回路4: {
      eye: [-130, 165, -120],
      center: [-130, 140, -50],
    },
    综合贯通低压进出线柜回路5: {
      eye: [-130, 165, -120],
      center: [-130, 140, -50],
    },
    综合贯通低压进出线柜回路6: {
      eye: [-130, 165, -120],
      center: [-130, 140, -50],
    },
    综合贯通低压进出线柜回路7: {
      eye: [-130, 165, -120],
      center: [-130, 140, -50],
    },
    // 环境监控
    水位传感器: { eye: [122, 8, 465], center: [122, 120, 10] },
    空调: { eye: [5, 185, -125], center: [5, 145, 50] },
    检修走廊_风机: { eye: [25, 600, -300], center: [25, 125, 20] },
    操作走廊_一级贯通侧风机: { eye: [25, 600, -300], center: [25, 125, 20] },
    操作走廊_综合贯通侧风机: { eye: [25, 600, -300], center: [25, 125, 20] },
    一级贯通变压器室_风机: { eye: [25, 600, -300], center: [25, 125, 20] },
    综合贯通变压器室_风机: { eye: [25, 600, -300], center: [25, 125, 20] },
    温湿度控制器: { eye: [10, 560, -520], center: [10, 105, 5] },
    // 视频监控
    操作走廊_一级贯通侧_巡视球机: {
      eye: [-5, 245, -165],
      center: [80, 200, -95],
    },
    操作走廊_综合贯通侧_巡视球机: {
      eye: [-20, 245, -165],
      center: [75, 210, -105],
    },
    室外监控球机_01: { eye: [-490, 320, -480], center: [-125, 60, -30] },
    室外监控球机_02: { eye: [-545, 270, 465], center: [-25, 10, -110] },
    检修走廊_监控枪机: { eye: [-235, 335, 555], center: [25, 15, -95] },
    一级贯通变压器室_热成像摄像机: {
      eye: [410, 245, 80],
      center: [-35, -280, 80],
    },
    综合贯通变压器室_热成像摄像机: {
      eye: [-355, 240, 65],
      center: [-170, -160, 65],
    },
    // 消防火灾
    检修走廊_烟感: { eye: [6, 610, -420], center: [6, 115, 20] },
    操作走廊_烟感: { eye: [6, 610, -420], center: [6, 115, 20] },
    一级贯通变压器室_烟感: { eye: [6, 610, -420], center: [6, 115, 20] },
    综合贯通变压器室_烟感: { eye: [6, 610, -420], center: [6, 115, 20] },
    // 安防
    门禁: { eye: [28, 190, -600], center: [28, 110, 20] },
    // 在线监测
    无线测温装置: { eye: [16, 405, -260], center: [16, 90, 60] },
    无线测温接收器: { eye: [16, 405, -260], center: [16, 90, 60] },
    电缆头测温装置: { eye: [20, 205, -50], center: [60, 190, -50] },
    避雷器在线监测装置_01: { eye: [20, 205, -96], center: [60, 190, -96] },
    避雷器在线监测装置_02: { eye: [20, 205, -96], center: [60, 190, -96] },
    避雷器在线监测装置_03: { eye: [-20, 195, -80], center: [-125, 160, -80] },
    避雷器在线监测装置_04: { eye: [-20, 195, -80], center: [-125, 160, -80] },
    蓄电池在线监测装置: { eye: [80, 200, -90], center: [-110, 75, 70] },
    一级贯通侧_电能质量分析仪: {
      eye: [180, 200, -205],
      center: [180, 145, -55],
    },
    综合贯通侧_电能质量分析仪: {
      eye: [-130, 200, -205],
      center: [-130, 145, -55],
    },
    一级贯通变压器_温控器: { eye: [5, 230, 105], center: [146, 150, 105] },
    综合贯通变压器_温控器: { eye: [-5, 180, 120], center: [-180, 120, 120] },
    UPS: { eye: [-85, 160, -140], center: [-85, 125, -60] },
  },
  luoyang: {
    "1# 10kV进线柜": { eye: [-157, 130, 50], center: [-156, 65, -38] },
    "1# 备用出线柜": { eye: [-157, 130, 50], center: [-149, 65, -38] },
    "1# 母联柜": { eye: [-138, 130, 50], center: [-138, 65, -38] },
    "1# PT柜": { eye: [-157, 130, 50], center: [-149, 65, -38] },
    "1# 变压器出线柜": { eye: [-130, 130, 50], center: [-130, 65, -38] },
    "2# 10kV进线柜": {
      eye: [-150, 126, -45],
      center: [-150, 103, -10],
    },
    "2# 备用出线柜": {
      eye: [-143, 126, -45],
      center: [-143, 103, -10],
    },
    "2# 母联柜": {
      eye: [-138, 126, -45],
      center: [-138, 103, -10],
    },
    "2# PT柜": {
      eye: [-128, 126, -45],
      center: [-128, 103, -10],
    },
    "2# 变压器出线柜": {
      eye: [-120, 126, -45],
      center: [-120, 103, -10],
    },
    智能化屏: { eye: [150, 120, -40], center: [150, 92, 4] },
    "1#低压进线柜": { eye: [-10, 126, 56], center: [-10, 62, -40] },
    "1#低压出线柜一": { eye: [20, 126, 56], center: [20, 62, -40] },
    "1#低压出线柜二": { eye: [50, 126, 56], center: [50, 62, -40] },
    "1#低压出线柜三": { eye: [80, 126, 56], center: [80, 62, -40] },
    "1#低压无功补偿柜": { eye: [110, 126, 56], center: [110, 62, -40] },
    双电源切换柜: { eye: [140, 126, 56], center: [140, 62, -40] },
    "2#低压进线柜": { eye: [0, 120, -40], center: [0, 92, 4] },
    "2#低压出线柜一": { eye: [30, 120, -40], center: [30, 92, 4] },
    "2#低压出线柜二": { eye: [60, 120, -40], center: [60, 92, 4] },
    "2#低压出线柜三": { eye: [90, 120, -40], center: [90, 92, 4] },
    "2#低压无功补偿柜": { eye: [120, 120, -40], center: [120, 92, 4] },
    "2#无功补偿柜": { eye: [120, 120, -40], center: [120, 92, 4] },
    "3#低压柜": { eye: [120, 120, -40], center: [120, 92, 4] },
    "1#变压器": { eye: [-60, 132, 58], center: [-60, 98, 12] },
    "2#变压器": { eye: [-56, 118, -40], center: [-56, 118, -40] },
    温湿度传感器: { eye: [-10, 326, 152], center: [-10, 46, -2] },
    水位传感器: { eye: [310, 32, 2], center: [-10, 50, -2] },
    风机风阀: { eye: [-10, 326, 152], center: [-10, 46, -2] },
    高压室_空调: { eye: [-10, 326, 152], center: [-10, 46, -2] },
    低压室_空调: { eye: [-10, 326, 152], center: [-10, 46, -2] },
    高压室_除湿机: { eye: [-10, 326, 152], center: [-10, 46, -2] },
    低压室_除湿机: { eye: [-10, 326, 152], center: [-10, 46, -2] },
    室外监控球机_西北角: { eye: [-390, 154, -210], center: [-36, 30, 38] },
    室外监控球机_东南角: { eye: [352, 158, 228], center: [20, -8, -28] },
    室内巡视球机_01: { eye: [-126, 216, 98], center: [-126, 96, 14] },
    室内巡视球机_02: { eye: [-126, 216, 98], center: [-126, 96, 14] },
    室内巡视球机_03: { eye: [52, 216, 98], center: [52, 96, 14] },
    室内巡视球机_04: { eye: [52, 216, 98], center: [52, 96, 14] },
    室内巡视球机_05: { eye: [52, 216, 98], center: [52, 96, 14] },
    中间走廊_监控枪机: { eye: [196, 94, 0], center: [62, 58, 8] },
    "1#低压柜后走廊_监控枪机": { eye: [-46, 106, -128], center: [68, 38, -36] },
    "2#低压柜后走廊_监控枪机": { eye: [-36, 106, 128], center: [28, 68, 70] },
    "1#变压器_热成像摄像机": { eye: [-36, 106, 128], center: [28, 68, 70] },
    "2#变压器_热成像摄像机": { eye: [-60, 146, -22], center: [-60, 120, -30] },
    高压室_烟感: {
      eye: [-4, 298, 150],
      center: [-4, 90, 20],
    },
    低压室_烟感: {
      eye: [-4, 298, 150],
      center: [-4, 90, 20],
    },
    "1# 变压器室_烟感": {
      eye: [-18, 296, 0],
      center: [-40, 112, 0],
    },
    "2# 变压器室_烟感": {
      eye: [-18, 296, 0],
      center: [-40, 112, 0],
    },
    "1# 变压器室_灭焰装置": {
      eye: [-18, 296, 0],
      center: [-40, 112, 0],
    },
    "2# 变压器室_灭焰装置": {
      eye: [-18, 296, 0],
      center: [-40, 112, 0],
    },
    双切柜灭焰装置: {
      eye: [228, 156, -178],
      center: [34, 8, 48],
    },
    高压室_门禁: {
      eye: [-342, 100, -4],
      center: [32, 4, -2],
    },
    低压室_门禁: {
      eye: [346, 118, 0],
      center: [32, 4, -2],
    },
    高压_无线测温装置: {
      eye: [-2, 290, 204],
      center: [-2, 82, 28],
    },
  },
};
let data = JSON.stringify(viewInfo);

fs.writeFileSync("view-info.json", "");
fs.writeFileSync("view-info.json", data);
